src/DataProcessors/ДобавлениеДокументов/ДобавлениеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДобавлениеДокументов</name>
  <attributes>
    <name>Маска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>EnumRef.ВидыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Извещение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>CatalogRef.Документация</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Документация</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Catalogs/Документация/Документация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Документация</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Извещение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьПросмотрДляСЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ДобавлениеДокументов/Forms/Форма/Module.bsl
&НаСервере
Функция СоздатьДокумент(ДокВидДокумента,ДокНаименование,ДокИмяФайла,ДокКомментарий,ДокИзвещение,Родитель)
Док = Справочники.Документация.НайтиПоНаименованию(ДокНаименование,Истина,Родитель);	
	Если Док.Пустая() Тогда
	Док = Справочники.Документация.СоздатьЭлемент();
	Док.Родитель = Родитель;
	Док.ВидДокумента = ДокВидДокумента;
		Если Найти(ДокНаименование,"(") = 1 Тогда
		Код = Сред(ДокНаименование,2,Найти(ДокНаименование,")")-2);
		Док.Код = Число(Код);
		Наименование = СокрЛП(Сред(ДокНаименование,Найти(ДокНаименование,")")+1));
		Иначе	
		Наименование = ДокНаименование;
		КонецЕсли; 
	Док.Наименование = Наименование;
	Док.ИмяФайла = ДокИмяФайла;
	Док.Комментарий = ДокКомментарий;
	Док.Извещение = ДокИзвещение;
	Док.Записать();
	КонецЕсли;
Возврат(Док.Ссылка);
КонецФункции

&НаСервере
Функция ПолучитьКаталог(ВыбКаталог)
Возврат(ПолучитьТекущийКаталог(ВыбКаталог));	
КонецФункции

&НаКлиенте
Процедура ДобавитьДокументы(Команда)
	Для Каждого Док Из Объект.Документы Цикл
		Если Не Док.Пометка Тогда
		Продолжить;	
		КонецЕсли;		
			Если Не Док.Ссылка.Пустая() Тогда
			Продолжить;	
			КонецЕсли;
				Если Не ЗначениеЗаполнено(Док.ВидДокумента) Тогда
				Сообщить(Док.Наименование+" - не выбран вид документа!");
				Продолжить;
				КонецЕсли;
					Попытка
					ИмяКаталога = ПолучитьКаталог(Док.Группа);
					Файл = Новый Файл(ИмяКаталога);
						Если Не Файл.Существует() Тогда
						СоздатьКаталог(ИмяКаталога);			
						КонецЕсли;
			        Файл = Новый Файл(Док.ИмяФайла);
					ПереместитьФайл(Док.ИмяФайла,ИмяКаталога+"\"+Файл.Имя);
					Док.Ссылка = СоздатьДокумент(Док.ВидДокумента,Файл.ИмяБезРасширения,Файл.Имя,Док.Комментарий,Док.Извещение,Док.Группа);
					Исключение
					Сообщить(ОписаниеОшибки());
					КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого Док Из Объект.Документы Цикл
	Док.Пометка = Истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Для Каждого Док Из Объект.Документы Цикл
	Док.Пометка = Ложь;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
Объект.Маска = "*.*";
Объект.ДатаСоздания = ТекущаяДата(); 
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);

Диалог.Заголовок = "Выберите каталог для поиска";
Диалог.ПолноеИмяФайла = ""; 
Фильтр = "Все файлы (*.*)|*.*"; 
Диалог.Фильтр = Фильтр; 
Диалог.МножественныйВыбор = Ложь;
Диалог.Каталог = Объект.Каталог;
	Если Диалог.Выбрать() Тогда
	Объект.Каталог = Диалог.Каталог+"\"; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиФайлыДок(Команда)
Объект.Документы.Очистить();
Состояние("Обработка каталога...",,"Создание списка файлов");
МассивНайденных = НайтиФайлы(Объект.Каталог, Объект.Маска,Истина);
к = 0; 
	Для Каждого Файл из МассивНайденных Цикл	
	к = к + 1;
	Состояние("Обработка каталога...",к*100/МассивНайденных.Количество(),"Проверка списка файлов"); 
		Если Не Файл.ЭтоФайл() Тогда
		Продолжить;		
		КонецЕсли;		
			Если Объект.ИспользоватьДату Тогда
				Если НачалоДня(Файл.ПолучитьВремяИзменения()) <> НачалоДня(Объект.ДатаСоздания) Тогда
				Продолжить;		
				КонецЕсли;				
			КонецЕсли;
	Док = Объект.Документы.Добавить();	 
	Док.ИмяФайла = Файл.ПолноеИмя;
	Док.Наименование = Файл.Имя;
	ОбработкаПрерыванияПользователя();
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидДокумента(Группа)
ТекГруппа = Группа;
	Пока ЗначениеЗаполнено(ТекГруппа) Цикл
		Если ЗначениеЗаполнено(ТекГруппа.ВидДокумента) Тогда
		Возврат(ТекГруппа.ВидДокумента);	
		КонецЕсли;
	ТекГруппа = ТекГруппа.Родитель;	
	КонецЦикла;	
Возврат(Перечисления.ВидыДокументов.ПустаяСсылка());	
КонецФункции

&НаКлиенте
Процедура ДокументыГруппаПриИзменении(Элемент)
Элементы.Документы.ТекущиеДанные.ВидДокумента = ПолучитьВидДокумента(Элементы.Документы.ТекущиеДанные.Группа);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыИзвещениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СписокФайлов = Новый СписокЗначений;

Состояние("Обработка каталога...",,"Создание списка файлов");
МассивНайденных = НайтиФайлы(Объект.Каталог, Объект.Маска,Истина);
к = 0; 
	Для Каждого Файл из МассивНайденных Цикл	
	ОбработкаПрерыванияПользователя();
	к = к + 1;
	Состояние("Обработка каталога...",к*100/МассивНайденных.Количество(),"Проверка списка файлов (для отмены Ctrl+Break)"); 
		Если Не Файл.ЭтоФайл() Тогда
		Продолжить;		
		КонецЕсли;		
			Если Объект.ИспользоватьДату Тогда
				Если НачалоДня(Файл.ПолучитьВремяИзменения()) <> НачалоДня(Объект.ДатаСоздания) Тогда
				Продолжить;		
				КонецЕсли;				
			КонецЕсли;
	СписокФайлов.Добавить(Файл.Имя);
	КонецЦикла;
		Если СписокФайлов.Количество() > 0 Тогда
		Выборка = СписокФайлов.ВыбратьЭлемент("Выберите файл с извещением");
			Если Выборка <> Неопределено Тогда
			Элементы.Документы.ТекущиеДанные.Извещение = Выборка.Значение;			
			КонецЕсли; 
		КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСсылке(Команда)
Ф = ПолучитьФорму("Справочник.Документация.ФормаСписка");
Ф.Открыть();
Ф.Элементы.Список.ТекущаяСтрока = Элементы.Документы.ТекущиеДанные.Ссылка;
КонецПроцедуры
